init offset = -1

# Переменная для тестов: если True, открывает все картинки.
default persistent.unlock_gallery = False

init python:
    # Размеры миниатюры в меню
    gal_thumb_x = 384
    gal_thumb_y = 216
    
    class GalleryItem:
        def __init__(self, name, images_data, thumb=None):
            self.name = name
            self.images_data = []
            
            for item in images_data:
                # Передали ("имя", "описание")
                if isinstance(item, tuple):
                    self.images_data.append(item)
                # Если передали просто строку "cg cg1_1"
                else:
                    self.images_data.append((item, "")) 
            

            # Логика миниатюры
            if thumb:
                self.thumb = thumb
            else:
                if len(self.images_data) > 0:
                    self.thumb = self.images_data[0][0]
                else:
                    self.thumb = None

        def get_unlocked_list(self):
            if persistent.unlock_gallery:
                return self.images_data
                
            unlocked = []
            for img_name, desc in self.images_data:
                if renpy.seen_image(img_name):
                    unlocked.append((img_name, desc))
            return unlocked

        def is_visible(self):
            if persistent.unlock_gallery:
                return True
            for img_name, _ in self.images_data:
                if renpy.seen_image(img_name):
                    return True
            return False
            
        def num_unlocked(self):
            return len(self.get_unlocked_list())
        
        def num_total(self):
            return len(self.images_data)

    gallery_items = []

    def add_cg(name, images, thumb=None):
        gallery_items.append(GalleryItem(name, images, thumb))



# --- ЗАПОЛНЕНИЕ ГАЛЕРЕИ (ПРИМЕР) ---
init python:
    # Пример 1: Просто список картинок (без описаний)
    # "cg_escape_1" - это имя image, определенное в script.rpy
    #add_cg("Побег", ["cg_escape_1", "cg_escape_2", "cg_escape_3"])

    # Пример 2: С описаниями для каждой вариации
#   add_cg("Воспоминание о лете", [
#     ("cg_summer_1", "Это был теплый день."),
#      ("cg_summer_2", "Она улыбнулась мне."),
#       ("cg_summer_kiss", "Наш первый поцелуй.")
#    ], thumb="images/thumbs/summer_thumb.png") # Кастомная миниатюра

        # Пример 2: С описаниями для каждой вариации
    add_cg(_("Кафетерия Гелиос"), [
        ("cg cg1", _("В этот день кофе был особенно горьким.")),
    ])

    add_cg(_("Доклад"), [
        ("cg cg2_1", _("Начало доклада.")),
        ("cg cg2_3"),
        ("cg cg2_4", _("Критические данные.")),
        ("cg cg2_5", _("Конец записи.")),
    ])

    add_cg(_("Цюрих"), [
        ("cg cg3_1"),
    ])

    add_cg(_("Звездочка"), [
        ("cg cg4_1", _("Я помню этот свет...")),
    ])

    add_cg(_("Разгромлен"), [
        ("cg cg5_1", _("Первый удар.")),
        ("cg cg5_2", _("Посторонний шум.")),
        ("cg cg5_3", _("Крах и Триумф."))
    ])

    add_cg(_("Воспоминания 1"), [
        ("cg cg6_1"),
        ("cg cg6_2", _("'Такова её природа'")),
        ("cg cg6_3"),
    ])

    add_cg(_("Побег"), [
        ("cg cg7_1", _("Беги!")),
        ("cg cg7_2"),
        ("cg cg7_3", _("Хвост.")), 
        ("cg cg7_5_1", _("Блокада.")),
        ("cg cg7_5"),
        ("cg cg7_6"),
        ("cg cg7_8", _("Почти у цел-")),
        ("cg cg7_9", _("Свет в конце тоннеля."))
    ])

    add_cg(_("Цвета Белого снега и Черной Ночи"), [
        ("cg cg8_1", _("Холодная и отстраненная... как я.")),
        ("cg cg8_2", _("Давай сходим в Планетарий?"))
    ])

    add_cg(_("Поездка"), [
        ("cg cg9", _("GPS: Маршрут перестроен.")),
        ("cg cg10", _("Фары разрезают тьму."))
        ])

    add_cg(_("Кошмар"), [
        ("cg cg11_1-1", _("Ты - не Алекс.")),
        ("cg cg11_2", _("'Её' больше нет.")),
        ("cg cg11_3-1", _("Звук снова победил Тишину.")),
    ])

    add_cg(_("РАЗЫСКИВАЕТСЯ"), [
        ("cg cg12_1", _("Кто это?")),
        ("cg cg12_1-1", _("Мой фоторобот.")),
        ("cg cg12_2", _("Это же... моя подруга...")),
    ])

    add_cg(_("Уют дома"), [
        ("cg cg13_1"),
        ("cg cg13_2"),
    ])

    add_cg(_("Путь в Никуда"), [
        ("cg cg14"),
        ("cg cg15_1"),
        ("cg cg15_2"),
    ])

    add_cg(_("Идиллия"), [
        ("cg cg16", _("Кто все эти люди...?")),
    ])

    add_cg(_("Завод"), [
        ("cg cg17"),
        ("cg cg18"),
    ])

    add_cg(_("Аномик-3"), [
        ("cg cg19"),
        ("cg cg20_1"),
        ("cg cg20_2", _("Я не могу бросить его... только не снова.")),
        ("cg cg20_3", _("Вы нас не видете.")),
    ])

    add_cg(_("Хрущевка"), [
        ("cg cg22"),
        ("cg cg23", _("Я и мой Папа - Аргон!")),
    ])

    add_cg(_("Информационный Пузырь"), [
        ("cg cg24", _("Нам с Алекс также было весело...")),
        ("cg cg25"),
    ])

    add_cg(_("Непреступные Звезды"), [
        ("cg cg26_1"),
        ("cg cg26_2"),
        ("cg cg26_3"),
        ("cg cg26_4"),
        ("cg cg26_5", _("Селестия... Наконец-то я тебя нашла...")),
    ])

    add_cg(_("Ботанический сад"), [
        ("cg cg27_1"),
        ("cg cg27_2", _("Где же я видела похожий антураж?")),
        ("cg cg27_3", _("Она будто вышла из сказки.")),
    ])

    add_cg(_("Запретный Рай"), [
        ("cg cg28_1", _("Гортензии")),
        ("cg cg28_2", _("Где же я видела похожий антураж?")),
        ("cg cg28_3", _("Она будто вышла из сказки.")),
        ("cg cg28_4", _("Я испугала Тётю...")),
        ("cg cg28_5", _("Такова моя природа")),
    ])

    add_cg(_("Созвездие"), [
        ("cg cg29", _("Возможно... возможно, я и правда смогу найти ее, и тогда... я увижу в этих созвездиях Селестию...")),
    ])

    add_cg(_("Кафе 'Сахарная Комета'"), [
        ("cg cg30_1"),
        ("cg cg30_2"),
        ("cg cg30_3"),
        ("cg cg30_4"),
    ])

    add_cg(_("Концерт"), [
        ("cg cg31_1", _("Я смогу спеть... всё ради неё...")),
        ("cg cg31_2", _("...ради нашей мечты!")),
        ("cg cg31_3", _("Ну, что?! Веритас?! Готовы?!")),
        ("cg cg31_4", _("Готовы подарить свои сердца. Ради меня... Ради неё...?")),
    ])

    add_cg(_("Фан-встреча"), [
        ("cg cg32_1"),
        ("cg cg32_2"),
        ("cg cg32_3", _("Я и мои фанатки!")),
    ])

    add_cg(_("Бог в обличии девы"), [
        ("cg cg32_4", _("Ой! Это только для платный подписчиков <3")),
        ("cg cg32_5"),
        ("cg cg33_1", _("Нам сюда!")),
        ("cg cg33_2", _("Прости-Прости-Прости!")),
    ])

    add_cg(_("Золотой Час"), [
        ("cg cg33_4", _("Последнее, что я услышала - стук каблуков по кафелю, приближающийся из дальнего конца коридора.")),
    ])

    add_cg(_("Зависть"), [
        ("cg cg34", _("Мне бы больше чокер подошел...")),
        ("cg cg35_1", _("Незванка")),
        ("cg cg35_2", _("Это же моя гитара!")),
    ])

    add_cg(_("Идеальная Ученица"), [
        ("cg cg36_1"),
        ("cg cg36_2", _("Взгляд Ученицы")),
        ("cg cg36_3", _("Взгляд Куклы")),
    ])

    add_cg(_("Улей"), [
        ("cg cg-36-1b"),
        ("cg cg36-1a"),
    ])