label chapter2_act1_false_memories:

                scene bg chapter_2_false_memories-crash with Dissolve(0.125)
                # play music "music/BGM/DeepThere.ogg" fadein 15.0 fadeout 15.0 volume 0.5

                narrator """
                Сознание вернулось резким, болезненным рывком. Голова гудела, а в ушах стоял непрекращающийся звон. Ослепляющий свет фар сменился миганием оранжевых аварийных огней грузовика.

                Он замер в нескольких сантиметрах от ее двери, огромный и угрожающий даже в неподвижности. Его прицеп был разорван, а по дороге был разбросан груз – ящики, какие-то мешки, обломки.

                Из кабины доносились яростные крики водителя. Неон не понимала слов, но в них слышался страх и гнев.
                """
                # play sound "sounds/truck_driver_shouting_panicked_foreign_echo.ogg"

                narrator """
                Она выжила. Но надолго ли?

                Первая мысль, ясная и острая, как осколок стекла: 'Бежать'. Сейчас сюда приедет полиция, разбираться с аварией. И тогда – конец. Проверка документов, ее лицо в базе данных... ловушка захлопнется.
                """

                narrator "Она судорожно повернула ключ. Двигатель, на удивление, завелся с первого раза, взревев от протеста."

                # play sound "sounds/car_engine_start_rough.ogg"
                # stop music fadeout 1.0
                # play music "sounds/escape_renewed_desperate.ogg" loop

                narrator """
                Не обращая внимания на крики водителя фуры, она вдавила педаль газа в пол. 

                Машина отчаянно виляла. 

                Заднее правое колесо... прострелено. Оно спустило, и теперь каждый оборот отдавался глухой, ритмичной бултыхающейся дрожью. Но она ехала.
                """

                scene bg chapter_2_false_memories-escape with Dissolve(10.0) # Фон: ночное шоссе, вид из машины, начинается дождь
                # play sound "sounds/car_driving_damaged_tire.ogg" loop # Звук езды на спущенном колесе
                play ambient "ambient/raining_inside_car.mp3" fadein 20.0 fadeout 5.0


                narrator """
                Она неслась по темному шоссе, уносясь прочь от хаоса.

                Небо окончательно почернело, и первые капли дождя забарабанили по крыше.

                Ледяной ветер врывался в салон через зияющую дыру на месте заднего стекла. Холод пробирал до костей.
                
                Она не могла позволить себе думать о том, что произошло. О Маркусе. Об Алекс. О том, что она сделала.

                """
                neon "Зато... обзор сзади стал лучше..."
                narrator """Сквозь зубы, говорила неон. Это горькая шутка не вызвала даже тени улыбки

                Она ехала, пока огни места аварии не скрылись за поворотом.
                
                Свернув на менее оживленную дорогу, она заехала на обочину под сенью деревьев и заглушила двигатель.
                """
                # play sound "sounds/car_engine_stop.ogg"
                scene bg chapter_2_false_memories-alex_call with fade
                play music "music/BGM/Unreachable.ogg" fadein 5.0 fadeout 15.0 volume 0.5 noloop

                narrator """
                Тишина. Только стук дождя и ее собственное прерывистое дыхание. Первым делом – Алекс.

                Дрожащими пальцами она достала телефон. Батарея – девять процентов. Она нашла контакт 'Алекс' и нажала вызов.
                """

                # play sound "sounds/phone_dialing_tone.ogg"

                narrator "Длинные, мучительные гудки. И вот, на экране телефона появились цифры длительности разговора."
                neon "Алло, Алекс?"
                narrator "Сказала, она, но женский голос, не похожий на Алекс, перебил её."
                play sound "sfx/abonent-ne-abonent.mp3"
                narrator "Абонент временно недоступен, перезвоните позже. The subscriber is not available now please call back later."
                narrator "Короткие гудки отклоненного вызова.."
                # play sound "sounds/phone_call_no_answer.ogg"
                narrator """
                
                Неон позвонила Еще раз и ещё раз. Снова гудки и тишина.

                Паника начала подступать к горлу. Она быстро набрала сообщение: 'Алекс, ты в порядке? Ответь! Где ты?'

                Затем еще одно: 'Я ушла. Они гнались за мной. Алекс, пожалуйста, дай знать, что ты в безопасности!'

                Сообщения ушли. Но ответа не было.
                """

                narrator_nvl """
                
                Она спряталась. Конечно. 
                
                Она умная, она смогла уйти. 
                
                Выключила телефон, чтобы ее не отследили. Да. Именно так.
                
                Она сильная, она справится. Она просто ждет подходящего момента, чтобы ответить. Все хорошо...
                """
                nvl clear

                scene bg chapter_2_false_memories-highway_night with fade

                narrator """
                Она повторяла это про себя, как мантру, но холодный страх продолжал сжимать сердце.
                
                Нужно ехать дальше. Она снова завела машину. Навигатор в телефоне показал ближайший автосервис в каком-то городке в тридцати километрах.
                
                Нужно хотя бы поставить запаску, иначе она далеко не уедет.
                
                Она вернулась на шоссе. Дорога извивалась, спускаясь с гор.
                
                Из-за спущенного колеса и мокрого асфальта приходилось ехать медленно. Каждый встречный автомобиль с включенными дальними фарами заставлял ее сердце замирать.
                
                Внезапно впереди, на противоположной полосе, показались мигающие сине-красные огни. Они приближались. Быстро.
                """
                play sound "sfx/police_sirens_distant.mp3" fadein 15.0 loop
                scene bg chapter_2_false_memories-highway_night_police with dissolve

                narrator """
                Паника. Первая инстинктивная мысль – прижаться к обочине, пропустить.
                
                Так всегда учила ее опекунша: 'Будь послушной, не привлекай внимания, слушайся тех, кто в форме'.
                
                Затем вторая мысль, леденящая кровь: 'Скорая помощь... для Маркуса?'

                И, наконец, третья, самая ужасная: 'Полиция... за мной'.

                Вспомнив, что ее машина – красная, разбитая, с известным номером – это буквально кричащий на всю дорогу маяк, она резко крутанула руль вправо.
                
                Машину занесло, но она удержала ее на самой кромке обочины, почти в тени деревьев.
                """
                
                play sound "sfx/police_sirens_passby.mp3" fadein 5.0 fadeout 5.0

                narrator"""
                Она съежилась в кресле, стараясь стать невидимой. Полицейская машина с воем пронеслась мимо, в сторону гор, в сторону комплекса.

                Она не могла видеть, что там происходит, но знала: они ищут ее. Они знают, что она сделала.

                Они ехали не за ней. Пока что.
                """

                narrator "Переведя дух, она продолжила путь. Но теперь каждая тень казалась засадой, каждый свет фар – погоней. Паранойя стала ее вторым водителем."

                "Навигатор" "Через два километра держитесь правее, затем продолжайте движение по шоссе Е27. Внимание: впереди платный участок дороги и стационарный пост дорожной полиции."
                #TODO: Войс-актинг для навигатора.

                narrator """
                
                Механический, бесстрастный голос навигатора прозвучал для Неон как приговор.
                
                Пост полиции. Платная дорога. Это означало камеры, проверку, остановку. Ловушка.

                Она лихорадочно схватила телефон, переключая карту в режим спутника.
                """
                show cg cg9 with fade # Показать экран телефона с картой

                narrator """

                Ее палец дрожал, масштабируя изображение. Вот шоссе – яркая желтая линия. А вот... рядом, едва заметная, серая, извилистая нить, петляющая по темному лесному массиву.
                        
                Маршрут, помеченный как 'Старая лесопилка'. Грунтовая дорога. Без названия, без освещения.
                
                Но она шла параллельно шоссе и, судя по карте, где-то далеко впереди снова сливалась с какой-то второстепенной трассой, минуя КПП.

                Это был единственный путь. Безумный, рискованный, но единственный.

                Она увидела нужный съезд – неприметный, заросший травой, уходящий в темноту. Выбора не было.
                """
                # hide screen phone_gps_map

                # stop music fadeout 1.0
                narrator "Она свернула с гладкого асфальта на грязную, разбитую колею. Машину тут же начало трясти еще сильнее. Дождь усилился, превратившись в ливень."
                play ambient "ambient/raining_inside_car_driving.mp3" fadein 5.0 fadeout 5.0
                narrator "Навигатор тут же начал перестраивать маршрут, но вскоре сигнал GPS пропал в густом лесу и под плотными тучами."
                # play sound "sounds/gps_voice_signal_lost.ogg" # Звук "GPS-сигнал потерян"
                "Навигатор" "GPS-сигнал потерян."
return