label chapter4_5_kai_ito_interlude:

    play music "music/BGM/SunnyDay.opus" fadein 5.0 fadeout 5.0
    scene bg chapter_4_academy-veritas-academy-gate-2 with fade
    
    narrator """
    Меня зовут Кай Ито.
    
    На первый взгляд, я — обычный студент Академии Веритас. Троечник. Асоциальный тип, предпочитающий смотреть в окно и считать ворон.

    Но это лишь маскировка. На самом деле, во мне дремлет сила, способная изменить этот мир. Они просто еще не знают. Никто не знает...

    Я шел в общем потоке студентов к воротам Академии. Еще один скучный день. Еще восемь часов притворства.
    
    Они не знают, что мой 'правый глаз' видит потоки энергии, не знают, что я чувствую искажения в ауре этого мира.
    
    Вот, например, она.
    """

    scene cg-36_1 with dissolve

    narrator """

    Наша 'айдол' С ее огненно-рыжими волосами и изумрудными глазами. Она, как всегда, была в центре внимания.
    
    Какая-то первокурсница забыла сменную обувь, и рыжеволосая, не раздумывая, отдала ей свои кроссовки для физкультуры, оставшись в одних носках.
    
    Все вокруг восхищались ее добротой. 'Какая она добрая!', 'Она просто ангел!'… А, и да. Её звали Лили.
    
    Противно даже смотреть, не то что слушать.

    Она всем помогает. Вечно со всеми любезничает. Но я-то вижу. Я вижу то, что скрыто за этой идеальной улыбкой.
    
    Так противно. Это маска, скрывающая ее истинную сущность. Типичный троп из аниме.

    Но кто мне поверит? Да и некому говорить...
    """

    scene bg chapter_4-5_kai-flashback with fade

    narrator """

    Биология. Самый скучный предмет. Я сижу за своей задней партой у окна, и наблюдаю за облаками.
    
    Учительница, Акари-сенсей, что-то монотонно рассказывала про социальные структуры насекомых. Скука.
    """

    scene cg-36_2 with fade


    narrator """
    Я изредка поглядываю на Лили. Она сидит прямо, идеально конспектирует, иногда кивает словам учительницы.
    
    Механизм. Безупречный. Слишком безупречный.
    
    Так ведут себя только те, кто скрывает свою истинную природу.

    Внезапно я чувствую на себе взгляд. Ледяной, пронизывающий. 
    """

    scene featured_cg-36_3 with dissolve

    narrator """
    Лили. Она смотрит прямо на меня. Не на меня, а в меня.
    
    Ее голова не повернута, только глаза, скошенные в мою сторону под неестественным углом.
    
    В них нет ни тепла, ни любопытства. Только холодный, оценивающий взгляд сканера.
    """

    scene bg chapter_4-5_kai-flashback with Fade(0.125, 0.125, 0.125)

    narrator """
    Я резко отворачиваюсь, сердце колотится.

    Ее зеленые глаза на долю секунды показались мне абсолютно пустыми, как у куклы.
    """
    show akari smirk at right with dissolve

    akari "...именно поэтому матка является центром улья."
    
    akari sinister """
    Кай Ито, я вижу, тебе так интересно за окном, что ты, должно быть, уже знаешь ответ на мой следующий вопрос.
    
    Расскажи нам в чем заключается феномен 'танца пчел'?
    """

    narrator "Класс хихикнул. Классическая издевка. Но она не знала, с кем связалась."

    show kai neutral at left with dissolve
    kai neutral """
    
    'Танец пчел' — это сложная система символической коммуникации, используемая медоносными пчелами для передачи информации о местонахождении источников нектара.
    
    Круговой танец означает, что еда близко.
    
    Виляющий танец передает направление относительно солнца и расстояние через длительность 'виляющей' фазы.
    
    Это один из самых сложных языков в животном мире.
    """

    narrator "Я узнал об этом, проходя квест по сбору королевского желе в одной ММОРПГ, но я не стал об этом говорить."
    
    hide kai
    hide akari

    narrator """
        В аудитории повисла заминка. Акари-сенсей медленно опустила ладонь на кафедру, пристально разглядывая меня сквозь тонкие стекла очков.

        Она не ожидала от тихони с задней парты связного ответа.
    """

    scene bg chapter_4-5_kai-flashback-sunset with Dissolve(5.0)

    narrator """
        Когда прозвучал сигнал окончания пары и студенты гурьбой повалили к выходу, преподавательница окликнула меня по фамилии.
    """

    show akari neutral at right with dissolve
    show kai neutral at left with dissolve

    akari "Ито-кун, задержись на минуту."
    
    narrator "Она подошла к моей парте с доброжелательной, мягкой улыбкой."
    
    akari @excited """
        Я впечатлена твоим ответом, Кай. Правда.

        Не думала, что ты настолько глубоко погружен в тему энтомологии.

        Я бы хотела предложить тебе индивидуальный исследовательский проект. Это поможет подтянуть текущий балл перед экзаменационной сессией.
    """

    narrator """
        Она обратилась ко мне по имени. Заметила. Выделила из всей этой серой массы зубрил.
    """
    
    akari """
        Тема довольно специфическая...

        Я могла бы заглянуть к тебе сегодня вечером, чтобы передать вводные материалы и методичку. Заодно наметим план работы.
    """
    
    narrator "Ко мне? Домой? Преподавательница Академии? Кровь ударила в виски от гордости."
    
    kai "Д-да! Конечно, сенсей! Я подготовлю рабочее место!"
    
    akari "Вот и договорились. Жди после восьми, Кай."

    kai "{=thoughts}Наконец-то... Они поняли, кто я такой на самом деле.{/thoughts}"

    hide akari with easeoutright

    narrator "Она вышла из аудитории, а я остался стоять у окна, сжимая в кулаке лямку рюкзака."

    scene black with fade
    # play sound "sfx/doorbell.opus"

    play music "music/BGM/Swell.opus" fadein 5.0 fadeout 1
    narrator """
        Восемь вечера.

        Резкий двойной звонок в прихожей. Я бросился к двери, торопливо поправил воротник рубашки и повернул защелку замка.
    """

    show akari sinister

    kai "Сенсей! Проходите, я как раз-"
    
    scene black
    stop music fadeout 0.125
    pause 3.0
    
    $ persistent.prestory_kai_unlocked = True
return