label chapter4_5_seraphina_flashback:
    
    scene black with Dissolve(0.5)
    play music "music/BGM/Lilis_Lullaby_Memory_Corrupted.opus" noloop
    
    narrator """
        И в этот последний миг... я увидела ее глазами.
        
        Не глазами 'Зависти'. А глазами той, кем она была до. Глазами Нари.
        
        Я увидела вспышку ее последнего, самого горького воспоминания.
    """
    
    scene bg chapter_4_veritas_studio_day_sad with fade
    
    narrator """
        Я вошла в нашу студию. Место, где мы проводили столько часов вместе.

        ...я вернулась. Другой. Стала тем, кем мечтала. Я - Лили.
        
        Я ждала. Я мечтала, когда я прийду в нашу студию.
        
        Я сыграю ей. Я покажу ей, что стала лучше. Теперь она меня заметит. Теперь она меня полюбит.
    """
    
    show lily neutral at left with dissolve
    show seraphina young_neutral at right with dissolve

    narrator """
        Дверь открылась. Я вошла. И я увидела её скучающую. Настоящую. Моя Серафина.
        
        Увидев меня, на ее лице было замешательство.
    """

    seraphina "(Осторожно) ...Лили? А Где... где Нари?"
    
    narrator """
        Она не узнала меня.
        
        Она смотрела прямо на меня, но видела чужое лицо. И искала... меня. Ту, что я только что уничтожила.
        
        Я попыталась улыбнуться. Улыбкой Лили.
    """
    
    lily "Нари... она ушла за дополнительными покупками. Сейчас придёт! Но смотри! Смотри, как я научилась играть! Для тебя!"
    
    narrator "Я начала играть. Ту самую мелодию, которую мы сочиняли вместе, когда я была ещё другой. Но пальцы были чужими. Звук был... неправильным."
    
    narrator """
        Серафина не смотрела на гитару. Она смотрела на меня. И в ее глазах я увидела то, чего боялась больше всего.
        
        Не восторг. Не любовь.
        
        Ужас.
    """

    seraphina """
    (Отступает на шаг, ее голос дрожит)
    
    Ты... ты не Лили. И... и твои глаза...
    
    Что ты сделала с Нари? С Лили? Где моя подруга?!

    М-М-монстр!
    """

    lily "Стой! Серафина!"
    lily "..."

    narrator """
        Она поняла... Она почувствовала фальшь.
        
        Она увидела монстра, даже когда я носила лицо ангела.
        
        Она развернулась. И убежала.
        
        Она бросила меня. Навсегда.
        
        В погоне за ее любовью, я стала тем, что ее напугало. Я потеряла ее. Окончательно.

        Тогда, сущность ехидно прошептала мне в ухо:
    """

    "Сущность" """
        Хи-хи-хи... 
        
        Зачем зависеть от веры одной подруги, которая может отвернуться?
        
        Давай заставим верить в тебя ТЫСЯЧИ людей.
        
        И тогда эта ложь станет настолько плотной, что даже ты перестанешь слышать скрежет
    """

    narrator """
    Тогда... тогда я послушаласть его... или своё собственное эго...

    Но сейчас, я осознаю свою ошибку. Ошибку, которая стоила мне дружбы.

    Ведь в отражении мокрого асфальта я вижу не Лили и не Серафину. Я вижу Нари. Ту, кем я была раньше.

    """
return