label chapter4_5_seraphina_flashback:
    
    scene black with Dissolve(0.5)
    play music "music/BGM/LISTEN.ogg"
    
    narrator """
        И в этот последний миг... я увидела ее глазами.
        
        Не глазами 'Зависти'. А глазами той, кем она была до. Глазами Нари.
        
        Я увидела вспышку ее последнего, самого горького воспоминания.
    """
    
    scene bg chapter_4-5_nari-flashback with fade
    
    narrator """
        Я вошла в нашу студию. Место, где мы проводили столько часов вместе.

        ...я вернулась. Другой. Стала тем, кем мечтала. Я - Лили.
        
        Я ждала. Я мечтала, когда я прийду в нашу студию.
        
        Я сыграю ей. Я покажу ей, что стала лучше. Теперь она меня заметит. Теперь она меня полюбит.
    """
    
    show lily coat admiration at left with dissolve
    show seraphina young worried at right with dissolve

    narrator """
        Дверь открылась. Я вошла. И я увидела её скучающую. Настоящую. Моя Серафина.
        
        Увидев меня, на ее лице было замешательство.
    """

    seraphina "...Лили? А Где... где Нари?"
    
    narrator """
        Она не узнала меня.
        
        Она смотрела прямо на меня, но видела чужое лицо. И искала... меня. Ту, что я только что уничтожила.
        
        Я попыталась улыбнуться. Улыбкой Лили.
    """
    
    lily """
    Нари... Ах да... Снова сглупила.

    Она ушла за дополнительными покупками. Сейчас придёт!
    
    Но смотри! Смотри, как я научилась играть! Для тебя!

    Давай-же, посмотри!
    """

    scene featured_10cg-1-1 with fade
    
    narrator """
    Я начала играть. Ту самую мелодию, которую мы сочиняли вместе, когда я была ещё другой. Эту песню знала только она и я.
    
    Но пальцы были чужими. Звук был... неправильным.
    """
    
    narrator """
        Серафина не смотрела на гитару. Она смотрела на меня. И в ее глазах я увидела то, чего боялась больше всего.
        
        Не восторг. Не любовь.
        
        Ужас.

        Она отшатнулась, отступаала на шаг назад. Я обернулась и перестала играть.
    """

    scene featured_10cg-1-2 with dissolve

    lily "Серафина? Что-то не так?"

    seraphina "Ты... ты не Лили. И... и твои глаза..."

    scene featured_10cg-2 with dissolve
    
    seraphina """
    Что ты сделала с Нари? С Лили? Где моя подруга?!

    М-М-монстр!
    """

    lily "Стой! Серафина!"

    scene black with Dissolve(0.125)

    narrator "Она развернулась. И убежала. Хлопнула дверью, как выстрелом."

    lily "..."

    narrator """
        Я осталась одна в тишине. Гитара выпала из рук, ударившись об пол с жалобным, фальшивым звоном.
        
        Ноги подкосились и меня не держали. Я сползла по стене, обхватив голову руками.
    """

    scene featured_10cg-3-1 with fade

    lily """
        Нет... нет... Серафина... подожди...
        
        Я не монстр... Это я! Это я, Нари!
        
        Я сделала это ради тебя! Чтобы ты любила меня! Чтобы мы были равны!
        
        Пожалуйста... не уходи... не оставляй меня...
        
        Я... я ведь...
    """


    narrator """
        Я захлебывалась слезами. В ушах звенело от тишины, в которой больше не было её смеха.
        
        Она ушла. Она бросила меня. Навсегда.
        
        В погоне за её любовью, я стала тем, что её напугало. Я потеряла её. Окончательно.
        
        Мир вокруг начал рассыпаться. Моя новая 'идеальная' жизнь превратилась в руины за одну секунду.
        
        И в этой звенящей пустоте, в моей расколотой голове, раздался знакомый, ехидный шепот.
    """

    scene featured_10cg-3-2 with dissolve
    play music "ambient/Seraphina.opus" fadein 5.0 fadeout 5.0 volume 0.35 noloop

    "Сущность" """
        Хи-хи-хи... 

        Больно, правда?
        
        Зачем зависеть от веры одной подруги, которая может отвернуться? Которая такая слабая и пугливая?
        
        Давай заставим верить в тебя ТЫСЯЧИ людей.
        
        И тогда эта ложь станет настолько плотной, что даже ты перестанешь слышать скрежет своей разбитой души.
    """

    scene 10cg-3-3 with dissolve

    narrator """
    Я посмотрела на ударную установку у стены, накрытую брезентом. Как громоздкий гроб, прячущий труп.
    
    Я вспомнила об Аяме, которую мы все так и не нашли, забыли в погоне за новой жизнью...

    Которую мы просто заменили другой девушкой, чтобы продолжить нашу мечту.

    В тот вечер я поклялась себе, что меня никто не заменит собой.
    """

    scene featured_10cg-3-1 with dissolve

    nari """
    Мой стул никогда не будет пустым. Я буду сидеть на троне.

    Вокруг... вокруг одни лишь предатели, даже те, кто когда-то был так близок.
    
    Те, с кем я смеялась, плакала, мечтала. Те, кто обещал быть рядом навсегда. Те, кто спали со мной в одной кровати.

    Мне не нужны такие люди. Мне не нужны друзья, семья, партнеры... никто.

    А группа...? Группа — это Я. А остальные — это просто сменные детали.
    
    Я сделаю всё сама. Лучше одной, чем тащить за собой груз чувств и каких-то обязательств...
    """

    "Сущность" """

        Ты себя принижаешь, Нари.

        Ты и есть звезда, что включает свет.

        Ты и есть центр притяжения, ты - гравитация. Гравитация всегда одна, но всё вращается вокруг неё, понимаешь?

        А все остальные - держат твой подиум на своих плечах, смотрят на тебя с восхищением и завистью.
        
        Зачем тебе быть чьей-то копией?

        Забыла?
    """

    scene black with Dissolve(0.125)

    "Сущность" "Ты и есть - Серафина."
    

return