label dream_sequence_japan_3:

    scene cg-28_1 with Dissolve(5.0)
    narrator """
    Мама сказала что-то невыносимо жестокое. Тёте больно.

    Эта мысль жжет изнутри простой детской виной. Взрослые поссорились, но я должна все исправить. Должна утешить.

    Я выбегаю на мокрую траву сада. Холодные капли утренней росы обжигают босые ступни.

    Возле бамбуковой изгороди тяжело клонятся к земле синие гортензии. Их пышные шапки, умытые утренним туманом, кажутся вылитыми из синего фарфора.

    Я выбираю самый большой, самый красивый цветок, с трудом надламываю сочный стебель и бегу к Тёте.
    """
    scene featured_cg-28_2 with fade

    neon "Тётя, не грусти. Это тебе."

    narrator """
    Она медленно опускает взгляд. Ее лицо застыло белой, бесстрастной маской.

    Помедлив несколько секунд, она неохотно протягивает ладонь навстречу стеблю. Ее пальцы приближаются к лепесткам.
    """

    scene featured_cg-28_3 with Dissolve(0.125)

    narrator """
    И в ту долю секунды, когда кончики ее ногтей почти касаются цветка, пространство вокруг дает трещину.

    Синева лепестков на глазах блекнет, мгновенно вымываясь в мертвенно-пепельный оттенок.

    Следом за цветом исчезают все звуки.

    Утренний ветерок, шелест бамбука, крик птицы над крышей — все схлопывается в плотный, звенящий вакуум. В ушах остается лишь глухой, низкий гул.

    Стебель и соцветие в моих пальцах теряют плотность. Цветок не осыпается хлопьями и не ломается — он просто растворяется в воздухе, исчезая без следа, будто материю стерли ластиком.

    В открытую ладонь ударяет жестокий, леденящий мороз. Пальцы сводит глухим онемением.

    Мы замираем друг напротив друга: я — с пустой застывшей рукой, и она — с пальцами, замершими в пустоте.
    """

    scene cg-28_4 with Dissolve(0.125)

    narrator """
    Тётя отшатывается назад, словно от невидимого удара.

    Она смотрит на свои дрожащие пальцы, затем переводит ошеломленный взгляд на мою пустую, побелевшую ладонь.

    Вся ее надменность и холодность рассыпаются в прах. В ее расширенных зрачках плещется первобытный шок, на смену которому приходит леденящее, хищное прозрение.

    Она делает медленный шаг ко мне, но смотрит не на мои слезы, а на мою неподвижную руку.

    Ее губы беззвучно шевелятся, а голос звучит глухо и прерывисто, словно она произносит слова в бреду:
    """

    scene cg-28_5 with fade

    oganesson_young """
    Всё-же... я была права насчёт разломов...

    А твоя мать... Она знала.
    """

    narrator """
    Я не понимаю значения этих слов. Я слышу лишь чужой, пугающий холод в ее голосе.

    Я вижу, что Тётя отдернула руку и испугалась.

    Наверное, я выбрала плохой, ядовитый цветок. Или уколола ее несуществующим шипом.

    Я сделала ей больно.

    Слезы застилают глаза, и я начинаю плакать от беспомощности и накатившего страха.
    """

    stop music fadeout 5.0
    scene black with Fade(2.0, 2.0, 2.0)
    $ persistent.flashback_dream_3_unlocked = True

return
