label dream_sequence_japan_4:
    
    # Финал Сна: "Спасение"
    # scene house_on_fire_dream with Black(0.5) # Резкий переход
    # play sound "sounds/fire_chaos_dream_sounds.ogg" loop # Звуки пожара, криков, треска
    # music "sounds/dream_tragedy_theme.ogg" loop
    narrator "Резкий скачок. Ночь. Мой дом горит. Вокруг жар, крики, хаос. Люди в темных кимоно бегают с мечами. Я ничего не понимаю, я просто плачу, забившись в угол."
    narrator "И тут из дыма и огня появляется она. 'Тетя-гостья'. Она подхватывает меня на руки."
    oganesson_young "(Голос на фоне рева огня) Тише, маленькая. Теперь ты в безопасности. Я тебя спасу."
    narrator "Она выносит меня из пожара. Я вижу в ней спасительницу. Я не вижу катану в ее руке, перепачканную кровью. Я не понимаю, что это она – причина этого ада. Я просто цепляюсь за нее, как за единственное спасение в рушащемся мире."
return