label dream_sequence_japan_4:
    
    # Финал Сна: "Спасение"
    # scene house_on_fire_dream with Black(0.5) # Резкий переход
    # play sound "sounds/fire_chaos_dream_sounds.ogg" loop # Звуки пожара, криков, треска
    # music "sounds/dream_tragedy_theme.ogg" loop
    narrator "Резкий скачок. Ночь. Мой дом горит. Вокруг жар, крики, хаос. Люди в темных кимоно бегают с мечами. Я ничего не понимаю, я просто плачу, забившись в угол."
    narrator "И тут из дыма и огня появляется она. 'Тетя-гостья'. Она подхватывает меня на руки."
    oganesson_young "(Голос на фоне рева огня) Тише, маленькая. Теперь ты в безопасности. Я тебя спасу."
    narrator "Она выносит меня из пожара. Я вижу в ней спасительницу. Я не вижу катану в ее руке, перепачканную кровью. Я просто цепляюсь за нее, как за единственное спасение в рушащемся мире."
    narrator "..."
    narrator "Я слышу колыбель, я слышу как цокают две спицы. Я слышу, как гудит чайник."
    narrator "Я вижу окно, но в нем нет звезд. Я вижу горы, но в них нет того величия."
    narrator "'Мальвина'. Белая Ворона, что окунулось в синеву. 'Таковая её природа', 'Стань снова послушой и пустой.'"
    narrator "Это не Япония, а вся моя жизнь - череда неудач"
    narrator "Вся моя жизнь - чей-то не наполненный сосуд."
    narrator "Я - другая, а вся моя жизнь - это ложь."
    narrator "..."
    narrator "Как же я устала. Бесится внутри, рвется наружу. Хочется выть, хочется кричать, хочется бежать, хочется все бросить и уйти."
    narrator "Но я поняла. Я понимала это всегда."
    narrator "Люди не меняются. Люди - это то, что они есть. И я не могу изменить их, как не могу изменить себя."
    narrator "Люди - это шум, люди - это хаос, люди - это боль. Но что если шум окажется в вакууме? Что если хаос в космосе станет гармонией? Что если боль в космосе станет красотой?"
    neon "В МОЕЙ жизни - лжи больше не будет."
returnn