label chapter1_lab_noon_library:


        # Сцена в библиотеке/тихой комнате
        scene bg chapter_1_lab_library with fade
        play music "music/BGM/Rewrite-Remembrance.ogg" noloop fadein 1.5

        narrator """
        Библиотека оказалась просторной и почти пустой.

        Храм тишины посреди вечного, низкочастотного гула комплекса — «шума» как бы выразилась Неон, который Неон научилась ненавидеть.

        Она села за стол. Перед ней — стопка бумаги и дешевая ручка. Ее единственные инструменты в войне против хаоса.

        Она положила на стол стопку бумаги, свои заметки, дешевую ручку.

        Сделала глубокий вдох, пытаясь унять легкую дрожь в руках – смесь волнения и кофеина.

        Перед ней лежал чистый лист. \n
        Белый, как снег на вершинах за окном. \n
        Белый, как неизвестность, которую ей предстояло заполнить словами.
        """

        show cg cg2_1 with dissolve
        # play sound "sounds/pen_uncap.ogg" # Звук снятия колпачка с ручки
        narrator "Она сняла колпачок с ручки. Чернила на кончике выглядели блекло."

        neon "{=thoughts}С чего начать? 'Доклад об обнаружении аномального сигнала...' Нет. Не то.{/thoughts}"


        # Неон сидит за столом в библиотеке
        narrator """
        Она закрыла глаза, пытаясь снова услышать его.
        
        Этот сигнал. Он не был похож на другие. Вселенная полна {b}шума{/b}: рев квазаров, барабанная дробь пульсаров, белый шум реликтового излучения Это был предсказуемый, понятный хаос.
        
        Но {i}этот{/i} сигнал... он был другим. В нем была... структура. Почти что музыка.
        
        Словно кто-то играл симфонию, но на струнах, а затем наступила оглушительная {b}тишина{/b}. Пауза. И именно некую паузу, эту пустоту между строк, она и пыталась расшифровать.

        Это была не просто работа. Это стало своего рода одержимостью.
        
        Попыткой понять, откуда в ее душе это странное, почти забытое чувство... целостности, которое возникало каждый раз, когда она слышала его эхо.
        """

        narrator """
        Она встряхнула головой, отгоняя наваждение. Хватит поэзии. Нужны факты. Она решительно вывела первую строчку: 'Доклад об анализе аномального сигнала...'
        
        Ручка замерла. Дешевый пластик. Почти такая же была у нее в университете. И снова, как укол, всплыл образ из утреннего сна.
        """
return
