label chapter1_lab_noon_library_desk:

        scene cg-2_3 with dissolve
        # play sound "sounds/paper_rustle.opus" # Звук перелистывания заметок

        narrator """
        Улыбка тронула ее губы, а затем исчезла, растворившись в тишине библиотеки.

        Неон постучала ручкой по столу.

        Нобелевская речь... Кто бы мог подумать тогда, что это станет так реально?

        Анна сейчас действительно работает в CERN. \n
        Софи, кажется, уехала в Лондон и занимается финтехом. \n
        А она... она здесь.
        """
        
        neon "{=thoughts}Анна... Софи... Интересно, а что бы вы сказали мне сейчас?"
        
        narrator """
        С новой решимостью Неон вернулась к докладу. Ручка оставила на бумаге первую строчку: \n
        'Анализ аномальной ритмики в секторе Дельта-4'.

        Она писала быстро, почти не задумываясь, словно слова уже давно ждали своего часа, чтобы вырваться на бумагу.
        """

        neon "{=thoughts}'...устойчивый ритм исключает случайность. Это не просто всплеск энергии. Это... композиция. Смысл, скрытый за завесой пустоты...'"
        
        narrator """
        Неслучайный. Как и ее собственный путь сюда, в сердце Альп, к этому открытию.

        Хотя иногда ей казалось, что вся ее жизнь до этого момента была чередой случайностей и серых будней.

        Особенно там, в той маленькой деревушке у подножия гор, где прошло ее детство и юность. \n 
        До Цюриха. \n 
        До звезд.

        Откуда вообще взялся этот зов, это почти фанатичное стремление к звездам?

        Она и сама совсем не понимает.

        Частичные осколки прошлого мимолетно пролетают перед её глазами, но их недостаточно, чтобы составить полноценную картину.
        """

        scene cg-2_4 with dissolve

        narrator "Неон глубоко вздохнула, отгоняя холодные тени прошлого. Она здесь. Она вырвалась. И она нашла... не ответ, нет, а первый ключ к разгадке."

        scene cg-2_4 with dissolve
        # play sound "sounds/pen_tap.opus" # Звук постукивания ручкой по столу

        narrator """
        Даже сейчас, окруженная чудесами науки и техники, она иногда чувствовала себя той же девчонкой с синими волосами, смотрящей на звезды из окна своей комнаты в глухой провинции…

        Но теперь у нее был шанс это изменить.

        Воспоминание, у которого не было лица. Еще один обрывок шума.

        Сейчас это неважно. Важно донести свое открытие до этих скептиков из ученого совета.
        """

        neon "{=thoughts}Сосредоточься. Порядок. Нужен порядок."

        narrator """
        Доказательством того, что Вселенная — это не просто бесконечный, хаотичный шум случайных событий.

        Что где-то в этой оглушающей какофонии взрывающихся звезд и умирающих галактик существует структура. Смысл. Музыка.

        Этот сигнал из сектора Дельта-4 и был ею.

        Теперь ее рука не дрожала. Она писала с лихорадочной, почти одержимой точностью. Каждая буква, выведенная на бумаге, была актом борьбы.

        Нужно было закончить. Нужно доказать

        Ручка царапала бумагу. Почерк становился все более неровным, торопливым. Она взглянула на часы – время поджимало.
        """

        neon "'{=thoughts}...ритм повторяется. Это не шум. Это не природа...'"

        neon "'{=thoughts}...это кто-то создал. Кто-то, кто знает, что такое тишина...'"

        neon "'{=thoughts}...с высокой степенью вероятности — это послание. Или память...'"

        narrator "Послание. Память. Не хаос. Это было ключевое слово. Ее оправдание. Ее путь к спасению от тишины."


        scene featured_cg-2_5 with dissolve

        narrator """
        Она обвела эту фразу несколько раз. Ключевой момент.

        Мелькнула мысль о Маркусе и его странном визите к начальству. И об Алекс, которая сейчас корпит над ее рутинными отчетами. Все казалось каким-то неправильным, смещенным.
        
        Наконец, она поставила последнюю точку. Дрожащей рукой отложила ручку.
        
        На несколько секунд шум в ее голове стих. Гул комплекса, тиканье часов, даже ее собственное бешеное сердцебиение — все исчезло.
        
        Осталась только она и эти исписанные листы. Идеальный порядок. Тишина.
        
        Она вышла из библиотеки и направилась к лифтам, ведущим на верхние уровни – туда, где располагался административный блок и главные конференц-залы.
        """
return