# TODO: Translation updated at 2025-09-22 22:26

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:6
translate english_us ch3_left_wing_a9346b34:

    # narrator "Я осторожно подхожу к углу стены в левом крыле."
    narrator ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:9
translate english_us ch3_left_wing_70b9a5c6:

    # narrator "Заглянув за угол, я вижу ту самую сцену: трое мужчин греются у огня в бочке. Они не замечают меня."
    narrator ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:16
translate english_us ch3_left_wing_thug_talk_63704a80:

    # narrator "Они продолжают свой разговор о какой-то ерунде. Ничего полезного для меня."
    narrator ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:19
translate english_us ch3_left_wing_thug_talk_ed4221cb:

    # narrator "Я снова прислушиваюсь. На этот раз тон разговора сменился..."
    narrator ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:21
translate english_us ch3_left_wing_thug_talk_c56b98ea:

    # "Бандит 1" "...жалко мне его все-таки. Зверь, конечно, но... с дочкой такое."
    "Бандит 1" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:22
translate english_us ch3_left_wing_thug_talk_ce8dfbcb:

    # "Бандит 2" "Да уж, туман этот... не щадит никого. Говорят, она в коме. Он все деньги спускает на 'Сон', чтобы хоть как-то ее поддержать."
    "Бандит 2" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:23
translate english_us ch3_left_wing_thug_talk_fa6f7c3b:

    # "Бандит 1" "Потому и вкалывает на Гатса. Думает, накопит и свалит с ней куда-нибудь. Наивный."
    "Бандит 1" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:24
translate english_us ch3_left_wing_thug_talk_dc8d6103:

    # narrator "Дочь... в коме от тумана."
    narrator ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:24
translate english_us ch3_left_wing_thug_talk_3dc0d8e8:

    # narrator "Так вот в чем дело. Это его слабое место. Жестоко, но... это может стать моим ключом на свободу."
    narrator ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:32
translate english_us ch3_left_wing_thug_talk_c7386374:

    # narrator "Я уже все слышала. Больше они ничего важного не скажут."
    narrator ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:37
translate english_us ch3_left_wing_thug_talk_b61e0412:

    # narrator "Как только я делаю шаг к двери, намереваясь их окликнуть, их разговор становится громче. Я замираю за стеной, прислушиваясь... Их голоса доносились через щели в дверях."
    narrator ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:40
translate english_us ch3_left_wing_thug_talk_9dae95d5:

    # "Бандит 1" "...и смотри, когда солнце поднимется выше, на улицу ни ногой. Босс сказал, сегодня туман будет злой."
    "Бандит 1" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:41
translate english_us ch3_left_wing_thug_talk_79a79e82:

    # "Бандит 2" "Да знаю я. В прошлый раз надышался этой дрянью, потом неделю черным кашлял. Говорят, от него вообще крыша едет, если долго дышать."
    "Бандит 2" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:42
translate english_us ch3_left_wing_thug_talk_3a9288ba:

    # "Бандит 1" "Не то слово. Эта вонь... она тебя изнутри выжигает."
    "Бандит 1" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:43
translate english_us ch3_left_wing_thug_talk_feafd659:

    # "Бандит 2" "Эх, вот бы свалить отсюда... в Веритас-Сити. Говорят, там воздух чистый как слеза. И работа есть."
    "Бандит 2" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:44
translate english_us ch3_left_wing_thug_talk_7aff2933:

    # "Бандит 1" "Ага, свалить. Ты хоть знаешь, что там творится? Там за украденную шоколадку пальцы ломают."
    "Бандит 1" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:44
translate english_us ch3_left_wing_thug_talk_7f26f625:

    # "Бандит 1" "Порядок, конечно, идеальный, но шаг влево, шаг вправо – и ты в тюрьме. Не для таких, как мы, короче."
    "Бандит 1" ""

# game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:49
translate english_us ch3_left_wing_thug_talk_6fce0609:

    # neon "{=thoughts}Веритас-Сити... Город-академия. Чистый, безопасный, недостижимый. Другая вселенная. Я понимаю, что разговор с ними бесполезен."
    neon ""

translate english_us strings:

    # game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:13
    old "Подслушать разговор."
    new ""

    # game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:36
    old "Попытаться заговорить с ними."
    new ""

    # game/game-scripts/chapters/chapter3/2.2-left-wing.rpy:55
    old "Вернуться в главный холл."
    new ""

translate english_us strings:
    old "old:1758610390.0811179_27"
    new "new:1758610390.0811179_27"

    old "Да знаю я. В прошлый раз надышался этой дрянью, потом неделю черным кашлял. Говорят, от него вообще крыша едет, если долго дышать."
    new "Да знаю я. В прошлый раз надышался этой дрянью, потом неделю черным кашлял. Говорят, от него вообще крыша едет, если долго дышать."

    old "...жалко мне его все-таки. Зверь, конечно, но... с дочкой такое."
    new "...жалко мне его все-таки. Зверь, конечно, но... с дочкой такое."

    old "Я осторожно подхожу к углу стены в левом крыле."
    new "Я осторожно подхожу к углу стены в левом крыле."

    old "Да уж, туман этот... не щадит никого. Говорят, она в коме. Он все деньги спускает на 'Сон', чтобы хоть как-то ее поддержать."
    new "Да уж, туман этот... не щадит никого. Говорят, она в коме. Он все деньги спускает на 'Сон', чтобы хоть как-то ее поддержать."

    old "Не то слово. Эта вонь... она тебя изнутри выжигает."
    new "Не то слово. Эта вонь... она тебя изнутри выжигает."

    old "{=thoughts}Веритас-Сити... Город-академия. Чистый, безопасный, недостижимый. Другая вселенная. Я понимаю, что разговор с ними бесполезен."
    new "{=thoughts}Веритас-Сити... Город-академия. Чистый, безопасный, недостижимый. Другая вселенная. Я понимаю, что разговор с ними бесполезен."

    old "Заглянув за угол, я вижу ту самую сцену: трое мужчин греются у огня в бочке. Они не замечают меня."
    new "Заглянув за угол, я вижу ту самую сцену: трое мужчин греются у огня в бочке. Они не замечают меня."

    old "...и смотри, когда солнце поднимется выше, на улицу ни ногой. Босс сказал, сегодня туман будет злой."
    new "...и смотри, когда солнце поднимется выше, на улицу ни ногой. Босс сказал, сегодня туман будет злой."

    old "Они продолжают свой разговор о какой-то ерунде. Ничего полезного для меня."
    new "Они продолжают свой разговор о какой-то ерунде. Ничего полезного для меня."

    old "Я уже все слышала. Больше они ничего важного не скажут."
    new "Я уже все слышала. Больше они ничего важного не скажут."

    old "Я снова прислушиваюсь. На этот раз тон разговора сменился..."
    new "Я снова прислушиваюсь. На этот раз тон разговора сменился..."

    old "Потому и вкалывает на Гатса. Думает, накопит и свалит с ней куда-нибудь. Наивный."
    new "Потому и вкалывает на Гатса. Думает, накопит и свалит с ней куда-нибудь. Наивный."

    old "Эх, вот бы свалить отсюда... в Веритас-Сити. Говорят, там воздух чистый как слеза. И работа есть."
    new "Эх, вот бы свалить отсюда... в Веритас-Сити. Говорят, там воздух чистый как слеза. И работа есть."

    old "Как только я делаю шаг к двери, намереваясь их окликнуть, их разговор становится громче. Я замираю за стеной, прислушиваясь... Их голоса доносились через щели в дверях."
    new "Как только я делаю шаг к двери, намереваясь их окликнуть, их разговор становится громче. Я замираю за стеной, прислушиваясь... Их голоса доносились через щели в дверях."

