# TODO: Translation updated at 2025-09-22 22:26

# game/game-scripts/chapters/chapter3/2.5-stairs.rpy:3
translate english_us ch3_stairs_d9f87b92:

    # narrator "Ступени скрипят под ногами. Наверху лестницы путь преграждает хлипкая деревянная калитка."
    narrator ""

# game/game-scripts/chapters/chapter3/2.5-stairs.rpy:3
translate english_us ch3_stairs_ab9d5614:

    # narrator "Рядом с ней – дыра в крыше, через которую видны остатки стропил. По ним, теоретически, можно было бы выбраться наружу."
    narrator ""

# game/game-scripts/chapters/chapter3/2.5-stairs.rpy:10
translate english_us ch3_stairs_fbd34bad:

    # neon "{=thoughts}Возможно, оттуда я смогу сбежать... Но не пока этот громила стоит внизу. Он заметит меня в ту же секунду. Мне нужно отвлечь его внимание. Устроить что-то, что заставит его сорваться с места...{/thoughts}"
    neon ""

# game/game-scripts/chapters/chapter3/2.5-stairs.rpy:11
translate english_us ch3_stairs_03c35cad:

    # narrator "Идея начинает формироваться в моей голове. Простая, рискованная и, возможно, единственно верная. Нужно вывести его из себя."
    narrator ""

# game/game-scripts/chapters/chapter3/2.5-stairs.rpy:14
translate english_us ch3_stairs_b8d0e541:

    # narrator "План тот же: разозлить гиганта внизу и заставить его покинуть свой пост."
    narrator ""

translate english_us strings:
    old "old:1758610390.0871184_30"
    new "new:1758610390.0871184_30"

    old "План тот же: разозлить гиганта внизу и заставить его покинуть свой пост."
    new "План тот же: разозлить гиганта внизу и заставить его покинуть свой пост."

    old "{=thoughts}Возможно, оттуда я смогу сбежать... Но не пока этот громила стоит внизу. Он заметит меня в ту же секунду. Мне нужно отвлечь его внимание. Устроить что-то, что заставит его сорваться с места...{/thoughts}"
    new "{=thoughts}Возможно, оттуда я смогу сбежать... Но не пока этот громила стоит внизу. Он заметит меня в ту же секунду. Мне нужно отвлечь его внимание. Устроить что-то, что заставит его сорваться с места...{/thoughts}"

    old "Идея начинает формироваться в моей голове. Простая, рискованная и, возможно, единственно верная. Нужно вывести его из себя."
    new "Идея начинает формироваться в моей голове. Простая, рискованная и, возможно, единственно верная. Нужно вывести его из себя."

