# TODO: Translation updated at 2025-08-13 04:16

translate english_us strings:

    # game/modules/extras.rpy:18
    old "Дисклеймер"
    new ""

    # game/modules/extras.rpy:20
    old "Привет, дорогой игрок!"
    new ""

    # game/modules/extras.rpy:24
    old "Спасибо, что решили познакомиться с моей историей. Прежде чем вы окунетесь в этот мир, я хочу быть с вами полностью честным.\n\nЯ не художник, а в первую очередь рассказчик.\n\nУ меня в голове родилась история с персонажами, которых я полюбил, и мне безумно хотелось поделиться ею с кем-то ещё. Визуальная новелла показалась мне идеальным форматом для этого.\n\nЧтобы «оживить» мир и героев, я использовал современные технологии - все фоны, спрайты персонажей и иллюстрации (CG) были созданы с помощью нейросетей (AI). Это стало для меня тем самым мостиком, который позволил визуализировать то, что я придумал.\n\nПри этом всё остальное - сюжет, диалоги, характеры персонажей и сама идея - это полностью моя авторская работа, в которую я вложил душу.\n\nТакже хочу отметить, что в игре используется музыка, распространяемая по лицензии Royalty-Free, за что я безмерно благодарен её создателям.\n\nЭта новелла не является коммерческим проектом и создана исключительно из любви к историям."
    new ""

    # game/modules/extras.rpy:40
    old "Спасибо за ваше понимание! Надеюсь, вам понравится путешествие, которое вас ждёт."
    new ""

    # game/modules/extras.rpy:42
    old "Подтвердить"
    new ""

    # game/modules/extras.rpy:68
    old "Установите настройки"
    new ""

    # game/modules/extras.rpy:70
    old "В следующем меню вы можете задать настройки игры. Эти параметры можно изменить в любое время в меню."
    new ""

