# TODO: Translation updated at 2025-12-28 02:27

translate pot strings:

    # game/modules/extras.rpy:18
    old "Дисклеймер"
    new "Дисклеймер"

    # game/modules/extras.rpy:20
    old "Привет, дорогой игрок!"
    new "Привет, дорогой игрок!"

    # game/modules/extras.rpy:24
    old "Спасибо, что решили познакомиться с моей историей. Прежде чем вы окунетесь в этот мир, я хочу быть с вами полностью честным.\n\nЯ не художник, а в первую очередь рассказчик.\n\nУ меня в голове родилась история с персонажами, которых я полюбил, и мне безумно хотелось поделиться ею с кем-то ещё. Визуальная новелла показалась мне идеальным форматом для этого.\n\nЧтобы «оживить» мир и героев, я использовал современные технологии - все фоны, спрайты персонажей и иллюстрации (CG) были созданы с помощью нейросетей (AI). Это стало для меня тем самым мостиком, который позволил визуализировать то, что я придумал.\n\nПри этом всё остальное — сюжет, диалоги, характеры персонажей и сама идея - это полностью моя авторская работа, в которую я вложил душу.\n\nТакже хочу отметить, что в игре используется музыка, распространяемая по лицензии Royalty-Free, за что я безмерно благодарен её создателям.\n\nЭта новелла не является коммерческим проектом и создана исключительно из любви к историям."
    new "Спасибо, что решили познакомиться с моей историей. Прежде чем вы окунетесь в этот мир, я хочу быть с вами полностью честным.\n\nЯ не художник, а в первую очередь рассказчик.\n\nУ меня в голове родилась история с персонажами, которых я полюбил, и мне безумно хотелось поделиться ею с кем-то ещё. Визуальная новелла показалась мне идеальным форматом для этого.\n\nЧтобы «оживить» мир и героев, я использовал современные технологии - все фоны, спрайты персонажей и иллюстрации (CG) были созданы с помощью нейросетей (AI). Это стало для меня тем самым мостиком, который позволил визуализировать то, что я придумал.\n\nПри этом всё остальное — сюжет, диалоги, характеры персонажей и сама идея - это полностью моя авторская работа, в которую я вложил душу.\n\nТакже хочу отметить, что в игре используется музыка, распространяемая по лицензии Royalty-Free, за что я безмерно благодарен её создателям.\n\nЭта новелла не является коммерческим проектом и создана исключительно из любви к историям."

    # game/modules/extras.rpy:40
    old "Спасибо за ваше понимание! Надеюсь, вам понравится путешествие, которое вас ждёт."
    new "Спасибо за ваше понимание! Надеюсь, вам понравится путешествие, которое вас ждёт."

    # game/modules/extras.rpy:42
    old "Подтвердить"
    new "Подтвердить"

    # game/modules/extras.rpy:68
    old "Установите настройки"
    new "Установите настройки"

    # game/modules/extras.rpy:70
    old "В следующем меню вы можете задать настройки игры. Эти параметры можно изменить в любое время в меню."
    new "В следующем меню вы можете задать настройки игры. Эти параметры можно изменить в любое время в меню."

    # game/modules/extras.rpy:95
    old "ВНИМАНИЕ: КОНТЕНТ 18+"
    new "ВНИМАНИЕ: КОНТЕНТ 18+"

    # game/modules/extras.rpy:101
    old "Данная визуальная новелла содержит материалы, предназначенные исключительно для взрослой аудитории."
    new "Данная визуальная новелла содержит материалы, предназначенные исключительно для взрослой аудитории."

    # game/modules/extras.rpy:105
    old "{b}Игра затрагивает следующие темы:{/b}"
    new "{b}Игра затрагивает следующие темы:{/b}"

    # game/modules/extras.rpy:107
    old "• {b}Жестокое насилие и кровь:{/b} Сцены физической расправы, использование холодного и огнестрельного оружия, детальные описания травм."
    new "• {b}Жестокое насилие и кровь:{/b} Сцены физической расправы, использование холодного и огнестрельного оружия, детальные описания травм."

    # game/modules/extras.rpy:109
    old "• {b}Боди-хоррор и Инсектофобия:{/b} Детальные описания и изображения изуродованных тел, паразитирование насекомых в человеческом теле, трипофобия. Элементы боди-хоррора."
    new "• {b}Боди-хоррор и Инсектофобия:{/b} Детальные описания и изображения изуродованных тел, паразитирование насекомых в человеческом теле, трипофобия. Элементы боди-хоррора."

    # game/modules/extras.rpy:111
    old "• {b}Психологическое насилие:{/b} Газлайтинг, манипуляции, потеря контроля над телом и разумом, темы/упоминание суицида и селфхарма."
    new "• {b}Психологическое насилие:{/b} Газлайтинг, манипуляции, потеря контроля над телом и разумом, темы/упоминание суицида и селфхарма."

    # game/modules/extras.rpy:113
    old "• {b}Сексуальный подтекст и Недобровольные действия:{/b} Сцены с намеками на принуждение, домогательства, употребление веществ, лишающих воли, и фетишизированного насилия. Фан-сервис и нетрадиционные отношения."
    new "• {b}Сексуальный подтекст и Недобровольные действия:{/b} Сцены с намеками на принуждение, домогательства, употребление веществ, лишающих воли, и фетишизированного насилия. Фан-сервис и нетрадиционные отношения."

    # game/modules/extras.rpy:115
    old "• {b}Прочее:{/b} Ненормативная лексика, употребление алкоголя, осквернение тел умерших."
    new "• {b}Прочее:{/b} Ненормативная лексика, употребление алкоголя, осквернение тел умерших."

    # game/modules/extras.rpy:151
    old "РЕЖИМ 18+: ВКЛЮЧЕН"
    new "РЕЖИМ 18+: ВКЛЮЧЕН"

    # game/modules/extras.rpy:153
    old "РЕЖИМ 18+: ВЫКЛЮЧЕН"
    new "РЕЖИМ 18+: ВЫКЛЮЧЕН"

    # game/modules/extras.rpy:157
    old "ВАЖНО: Настройка «Режим 18+» скрывает только откровенные и особо жестокие иллюстрации (CG). Текстовое повествование остается неизменным и может вызвать дискомфорт независимо от настроек графики."
    new "ВАЖНО: Настройка «Режим 18+» скрывает только откровенные и особо жестокие иллюстрации (CG). Текстовое повествование остается неизменным и может вызвать дискомфорт независимо от настроек графики."

    # game/modules/extras.rpy:159
    old "Если вам нет 18 лет или вы чувствительны к подобным темам - пожалуйста, воздержитесь от игры."
    new "Если вам нет 18 лет или вы чувствительны к подобным темам - пожалуйста, воздержитесь от игры."

    # game/modules/extras.rpy:164
    old "ПОДТВЕРДИТЬ"
    new "ПОДТВЕРДИТЬ"

