label chapter4_5_concert:

    narrator "Я долго думала о Селестии и о нашей встречи в парке. Прошло 4 часа как я сидела в саду у скамейки, после того как Серафина покинула меня"
    narrator "Всё это время я думала о нашем уговоре с ней - прийти на концерт, рассказ о моей подруге. Я не могла заснуть всё это время."
    narrator "Я не спала, но будто меня тут и не было. Я просто смотрела на небо от ночи до утра. Как будто бездумно, как кукла."
    narrator "Я даже не подумала пойти к Аргону, просто, забыла..."
    narrator "А потом меня откликнул сотрудник сада, видимо, который работал в эту смену."
    narrator "Он тряс меня рукой по плечу, пытаясь разбудить..."

    "Сотрудник Сада" "Эй...? Эй, вы живы? Пожалуйста, ответьте"
    
    narrator "Зрачки Неон резко расширились от осознания того, что она в саду. И мертвое лицо засияло неожиданностью и изумлению"

    neon "А... Я... да... Извините... Просто... просто тут так прекрасно."

    "Сотрудник Сада" "Фух... я так испугался, что вам не хорошо и небось хотел уже позвонить в скорую..."

    narrator "'Позвонить'. Точно... это слово ударило мне прямо в голову, и я инстинктивно потянулась правой рукой к лавочке, пытаясь нащупать телефон, который мне подарили"
    
    neon "Скорую? Нет, спасибо... хех, не надо. Мне хорошо."

    "Сотрудник Сада" "Точно? Ну хотя-бы водички? Около выхода есть автомат с водой, я могу вас туда провести."

    neon "Ох, нет. Я же сказала, просто задремала от красоты вашего сада! Атмосферно, и напоминает мне... э... сны..."

    narrator "Я резко вспомнила о снах о Японии. Кажутся такими родными, такими настоящими. Будто я чувствовала запах снов.  Но вскоре я забросила эти мысли, думая что запах исходил из этого сада."
    narrator "Я сразу же переключилась на предложение садовника об автомате."

    neon "Около входа, да? А вы можете меня туда провести. Ну к выходу... я просто сама не понимаю, как сюда пришла... Да... неловко.. хе-хе..."

    "Сотрудник Сада" "Ну конечно! Идем за мной"

    narrator "Мы шли по разным уровням сада, я была на самом высоком - 4-ртом этаже Ботанического Сада Веритас. Мы быстро нашли лестницу в самый низ. Выход"
    narrator "Около дверей была турникетная система. Как я через них прошла...? Будучи без сил..."
    narrator "'Ладно, черт с ним', сказала я мысленно и провернула турникет. После чего я направлялась к выходу. Выходу из этого сада."

    "Сотрудник Сада" "Эй! Дамочка, постойте."

    narrator "Я резко повернулась к нему, зачем он меня остановил?"

    "Сотрудник Сада" "А как же вода? Я же вас привел сюда ради неё!"

    neon "Вода? А нет-нет, я хотела выйти. Спасибо вам за заботу, конечно."
    neon "Тем более... денег у меня нет, нечем платить... Ещё раз прощу прощения за неудобство."

    narrator "Я было почти развернулась и пошла к выходу, как он продолжил диалог."

    "Сотрудник Сада" "Нет денег...? А как же телефон? Он же у вас был"

    neon "Телефон? А как он мне поможет с деньгами? Карточки же у меня нет."

    "Сотрудник Сада" "Постойте-постойте"

    narrator "Его лицо стало серьезным, даже каким-то расстеряным"

    "Сотрудник Сада" "Каждому гражданину Веритас устанавливается приложение государственных услуг. При приёме на работу вам открывают счёт работника. Вам работодатель этого не говорил?!"

    narrator "'Работа', 'Услуги'? Я не понимаю о чем он говорит, мы будто ведём одну тему на разных языках. У меня не было здесь работы, тем более гражданства. Я хочу ему объяснить ситуацию, но лучше про гражданство промолчу"

    neon "Работа? Ха-ха... не... нет... У меня нет работы пока-что. Я... лучше пойду."

    "Сотрудник Сада" "Нет работы?! Вы... студентка, так?"

    neon "Нет, я не студентка... если вы про Академию Веритас... Досвидание"

    narrator "Мне было неловко. Я уже хотела-бы уйти, но он решительно идет ко мне за турникеты, и хватает меня за руку."

    "Сотрудник Сада" "Стойте. А откуда у вас тогда такой современный телефон?"

    neon "Ну... мне подарила одна женщина когда я к ней в гости ходила, сказала, что ей больше не нужен. Можно я уже пойду?"

    narrator "Я стала нервничать, пытаясь оддернуться. Но он держал крепно. Не больно, но довольно сильно."

    "Сотрудник Сада" "Ваше имя как?"

    narrator "Он стал грубее, более кратче ко мне. Меня это уже не волновало, сколько бесило."

    neon "Неон, Не-он. Меня зовут! Отстаньте уже!"

    narrator "Я пытаюсь смахнуть руку, но не получается."

    "Сотрудник Сада" "Ясно, я вызываю полицию. Стойте смирно."

    narrator "'Полиция'. Это слово ударило мне прямо в мозг. Придавая бессилие, опьящяющее. Я вспомнила свою погоню, я вспомнила как меня искали и как я пряталась. И глаза начали болеть от притока крови и от того, что они расширились."

    neon "З-за что...?"

    narrator "Я пытаюсь оддернуться от него ещё сильнее, и сильнее, и чаще но он меня держит"

    "Сотрудник Сада" "Ты ещё спрашиваешь? Шваль! Мало того, что ты туниядец, чертовка, не благодарная. Бросаешь идею общего блага. Так ты ещё и украла чужой телефон! Обманом, у состоятельной женщины!"
    "Сотрудник Сада" "Я уже молчу про то, что ты тут ошиваешься, ищешь убежище. Ведь тебе не куда поддаться!"
    "Сотрудник Сада" "Так, всё. Я провожу гражданский арест. Будешь знать, какого это сидеть в Системнике! Там тебе мозги точно вправят!"

    narrator "Он берёт свой телефон из карманов и звонит в полицию. Это не розыгрышь, не обман и даже не сон. Это реальность Веритаса, его механизма."

    "Сотрудник Сада" "Алло? У меня тут девушка, притворяется ученой. Кража одежды, кража телефона."
    "Сотрудник Сада" "А? Ну.. синие волосы, маленькая."

    narrator "'Синие волосы', 'Маленькая', я сразу вспоминаю как меня обижали в школе, и всей своей злостью, решимостью беру свои руки в кулак от злости и пинаю его в пах свободной ногой"

    "Сотрудник Сада" "Да, мэм. Я провёл гражданс-"

    narrator "Я бью его промеж ног с такой силой, что телефон, который он держал улетает в потолок, а его рука отпускает мою. Сам он падает."

    narrator "Я резко выбегаю из этого места, уже ужаснного места прочь"
    narrator "Теперь, я всё поняла. В этом городе правда только одна. Та, которая считается приемлемой"


return