    # ВОЗВРАЩЕНИЕ ПЕРСПЕКТИВЫ
    
    scene bg chapter_4_veritas_streets_night with fade
    play music "music/BGM/VeritasCity_NightTheme_Melancholy.ogg" loop
    show neon neutral at right
    show argon suit_apathy at left
    
    neon "Аргон, тише! Смотри, там что-то про Академию!"
    
    narrator """ 
    Мы шли по одной из центральных площадей, обсуждая план проникновения в общежитие. На огромном голографическом экране, где обычно крутили рекламу, шел экстренный выпуск новостей.
    """

    "Ведущая новостей" "...и снова трагедия в элитной Академии Веритас. Сегодня в своей квартире был найден мертвым студент второго курса, Кай Ито. По предварительным версии следствия, причиной смерти стало самоубийство."
    
    narrator "На экране появилось фото улыбающегося парня."
    
    "Директор Академии" " Кай был одним из наших лучших учеников. Отличник, душa компании, у него было множество друзей. Мы все шокированы этой трагедией. Вероятно, это связано с какими-то личными, семейными проблемами, о которых мы не знали..."
    
    argon "Лучший ученик. Куча друзей. Врут. И даже не краснеют."
    
    neon "Но... зачем?"
    
    argon "Репутация, Неон. В этом городе репутация — это все. Проще объявить парня самоубийцей с 'семейными проблемами', чем признать, что в их идеальной Академии не всё так однозначно."
    
    narrator "Я смотрела на экран, и холодное осознание начало проступать сквозь туман усталости. Это не просто пропажи. Это уже смерти. И система делает все, чтобы скрыть правду."