label chapter9_xenon: 
    # --- СЦЕНА 4: АРХИВАРИУС ---

    scene black with Fade(3.0, 1.0, 2.0)
    stop music fadeout 3.0

    # play sound "sfx/book_closing_heavy_final.opus"

    narrator """
        ХЛОП.
    """

    scene bg xenons_library_desk with dissolve
    play music "music/BGM/Library_Whispers_Warm.opus" fadein 2.0 loop volume 0.4

    narrator """
        Тяжелая обложка закрылась, подняв в воздух облачко золотистой книжной пыли.
        
        В Карманной Библиотеке, существующей вне времени и человеческих трагедий, стояла привычная, уютная тишина.
    """

    show xenon librarian_smile at center with dissolve

    narrator """
        Ксенон провел рукой в плотной перчатке по кожаному переплету. 
        
        На обложке тусклым серебром было выведено название: 
        
        'Полутонный Резонанс'.
    """

    narrator """
        Архивариус бережно поднял книгу и посмотрел на неё с глубокой, почти отеческой теплотой.
    """

    xenon """
        Спасибо тебе, Неон.
        
        За такую потрясающую, честную и смелую историю.
    """

    narrator """
        Он подошел к огромному стеллажу и аккуратно поставил книгу на полку, где ей суждено было храниться вечно.
        
        Рядом с книгой под названием 'Отряд Затмений', время которой еще не пришло.
    """

    xenon """
        Было честью... провести с тобой всё это время.
        
        Спи спокойно, Абсолютная Тишина.
    """