label ch3_stairs:
    # Лестница из V1, теперь работает как "фейковый выход"
    narrator """
    Ступени скрипят под ногами. Наверху лестницы путь преграждает хлипкая деревянная калитка.

    Рядом с ней – дыра в крыше, через которую видны остатки стропил. По ним, теоретически, можно было бы выбраться наружу.
    """
    neon "(Мысленно) Возможно, оттуда я смогу сбежать... Но не пока этот громила стоит внизу. Он заметит меня в ту же секунду. Мне нужно отвлечь его внимание. Устроить что-то, что заставит его сорваться с места."
    narrator "Идея начинает формироваться в моей голове. Простая, рискованная и, возможно, единственно верная."
    jump ch3_hall_explore